### Test 1

The customer wants to add two new items using the `add_item()` method. The items added are as follows:

- Item Name: Fried Chicken, Qty: 2, Price: 20000
- Item Name: Toothpaste, Qty: 3, Price: 15000

In [1]:
from cashier import cashier

In [2]:
transaction = cashier.Transaction()

In [3]:
transaction.add_item("Fried Chicken", 2, 20000)
transaction.add_item("Toothpaste", 3, 15000)

       item_name  items_number  item_price  total_price
1  Fried Chicken             2       20000        40000
2     Toothpaste             3       15000        45000

### Test 2

It turns out that the Customer mistakenly bought one of the items from the groceries that had been added, so the Customer uses the `delete_item()` method to delete the item. The removed item is <b>Toothpaste</b>.

In [4]:
transaction.delete_item("Toothpaste")

       item_name  items_number  item_price  total_price
1  Fried Chicken             2       20000        40000

### Test 3

It turns out that after thinking about it the customer entered the wrong item he wanted to spend! Instead of deleting them one by one, the Customer can simply use the `reset_transaction()` method to delete all items that have been added.

In [5]:
transaction.reset_transaction()

'All items have been successfully deleted!'

### Test 4

After the customer has finished shopping, he will calculate the total expenditure that must be paid using the `total_price()` method. Before issuing the total shopping output, it will display the items purchased.

In [7]:
transaction.add_item("Fried Chicken", 2, 20000)
transaction.add_item("Toothpaste", 3, 15000)
transaction.add_item("Car Toy", 1, 200000)
transaction.add_item("Instant Noodles", 5, 3000)

         item_name  items_number  item_price  total_price
1    Fried Chicken             2       20000        40000
2       Toothpaste             3       15000        45000
3          Car Toy             1      200000       200000
4  Instant Noodles             5        3000        15000

In [8]:
transaction.check_order()

         item_name  items_number  item_price  total_price
1    Fried Chicken             2       20000        40000
2       Toothpaste             3       15000        45000
3          Car Toy             1      200000       200000
4  Instant Noodles             5        3000        15000

In [9]:
transaction.get_total_price()

'the total amount to be paid is Rp. 285000.0'